<?php
// символ ` заменяется на нэймспэйс
return [
    'key'    => 'Ид',
    'fields' => [
        'id_1c'     => 'Ид',
        'articul'   => 'Артикул',
        'name'      => 'Наименование',
        'is_active' => 'ПометкаУдаления',
        'img'       => 'Картинка',
        'imgs'      => [
            'path' => 'Картинка[position()>1]',
        ],
        'content'   => 'Описание',
        'groups'    => [
            'path' => 'Группы/Ид',
        ],
        'full_name' => 'ЗначенияРеквизитов/ЗначениеРеквизита[`Наименование="Полное наименование"]/Значение',
    ],
];
