<?php
/**
 * Created by PhpStorm.
 * User: Help4
 * Date: 16.07.2015
 * Time: 17:57
 */
// символ ` заменяется на нэймспэйс
return array(
    'key'    => 'Ид',
    'fields' => array(
        'Ид'            => 'id_1c',
        'Артикул'       => 'articul',
        'Наименование'  => 'name',
        'ПометкаУдаления' => 'is_active',
        'Картинка'      => 'img',
        'category_id'   => array(
            'path' => 'Группы/Ид',
        ),
        'url'   => array(
            'path'  => 'ЗначенияРеквизитов/ЗначениеРеквизита[`Наименование="СсылкаНаСайте"]/Значение',
        ),
        'full_name' => array(
            'path'  => 'ЗначенияРеквизитов/ЗначениеРеквизита[`Наименование="Полное наименование"]/Значение',
        ),
    ),
);
