<?php

return [
    'key' => 'Ид',
    'fields' => [
        'orderId1c' => 'Ид',
        'orderNumber1c' => 'Номер1С',
        'is_active' => 'ПометкаУдаления',
        'date_create' => 'Дата1С',
        'price' => 'Сумма',
        'order_comment' => 'Комментарий',
        'discard' => 'ЗначенияРеквизитов/ЗначениеРеквизита[`Наименование="Отменен"]/Значение',
        'status' => 'ЗначенияРеквизитов/ЗначениеРеквизита[`Наименование="Статуса заказа ИД"]/Значение',
        'delivery_address' => 'ЗначенияРеквизитов/ЗначениеРеквизита[`Наименование="Адрес доставки"]/Значение',
        'goods'      => [
            'field' => [
                'good_id_1c' => 'Ид',
                'name' => 'Наименование',
                'count' => 'Количество',
                'price' => 'Цена',
                'sum' => 'Сумма',
                'discount' => 'Скидки/Скидка/Сумма',
            ],
            'path' => 'Товары/Товар',
        ],
        'customer'      => [
            'field' => [
                'id_1c' => 'Ид',
                'name' => 'Наименование',
                'phone' => 'Контакты/Контакт[`Тип="Телефон рабочий"]/Значение',
                'email' => 'Контакты/Контакт[`Тип="Электронная почта"]/Значение',
            ],
            'path' => 'Контрагенты/Контрагент',
        ],
    ],
    'updateDbFields'  => [
        'ID'        => 'ID',
        'pos'       => 'pos',
    ],
];
