<?php

// символ ` заменяется на нэймспэйс
return [
    'key'    => 'Ид',
    'fields' => [
        'name'       => 'Наименование',
        // todo то, что помечено на удаление — вообще не добавлять к выгрузке
        //        'ПометкаУдаления'   => 'is_active',
        'dir_params' => [
            'path'  => 'ЗначенияСвойств/ЗначенияСвойства',
            'field' => [
                'dir_id_1c' => 'Ид',
                'dir_value_id' => 'Значение',
            ],
        ],
    ],
    'priceFields'   => [
        'price'     => 'Цены/Цена[not(preceding-sibling::`Цена/ЦенаЗаЕдиницу <= `ЦенаЗаЕдиницу)'
            . ' and not(following-sibling::`Цена/ЦенаЗаЕдиницу < `ЦенаЗаЕдиницу)]/ЦенаЗаЕдиницу',
        'currency'  => 'Цены/Цена/Валюта[1]',
    ],
    'priceRests'    => [
        'rest' => 'Остатки/Остаток/Склад/Количество'
            . '[not(preceding-sibling::`Склад/Количество > text() or following-sibling::`Склад/Количество > text())]',
    ],
];
